{
  "about": {
    "sectionTitle": "About",
    "title": "Experienced Front End Engineer",
    "motto": "I build exceptional and accessible digital experiences for the web.",
    "text": "In 2023, I embarked on my Software Engineering degree at UNOPAR, complemented by courses at <a href='https://jstack.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>JStack</a> and <a href='https://rocketseat.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>Rocketseat</a> bootcamps. Based in Santa Cruz do Sul/Rio Grande do Sul, I'm a seasoned Frontend Web Developer proficient in React, TypeScript, Next.JS, PHP, and Laravel. <br /><br /> At <a href='https://meta.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>Meta</a> since 2022, I currently lead the development of an AI chatbot, enhancing customer support through React, Tailwind CSS, Redux, and TypeScript. My previous roles involved contributing to a universal ERP software and leading the development of a payments platform, showcasing adaptability and leadership. <br /><br /> Before Meta, I served as a Junior Web Developer at <a href='https://webde.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>Webde Tecnologia</a>, excelling in interface development using Next.JS, PHP, and Laravel. I kickstarted my career at <a href='https://www.nucleosistemas.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>Nucleo IT</a>, installing BI systems and developing business websites. <br /><br /> Amidst this exciting journey, my girlfriend and our furry companion are my pillars of support. Their encouragement fuels my passion for web development, turning challenges into shared victories. Fluent in English, conversational in Spanish, and a native Portuguese speaker, I balance my tech passion with gaming, playing football, a lot of family time, and occasional adventures around Brazil. My journey reflects a commitment to learning and crafting user-centric web solutions in the ever-evolving tech landscape, with a great passion about UX."
  }
}
