{
  "sections": {
    "about": "About",
    "experiences": "Experiences",
    "projects": "Projects",
    "devlog": "Devlog"
  },
  "about": {
    "title": "Experienced Front End Engineer",
    "motto": "I build exceptional and accessible digital experiences for the web.",
    "text": "In 2023, I started my Software Engineering degree at UNOPAR, complemented by courses from <a href='https://jstack.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>JStack</a> and bootcamps from <a href='https://rocketseat.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>Rocketseat</a>. Based in Santa Cruz do Sul, Rio Grande do Sul, I am an experienced Frontend Web Developer proficient in React, TypeScript, Next.js, PHP, and Laravel. <br /><br /> Currently, at <a href='https://www.mobiauto.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>Mobiauto</a>, I am focused on developing an ERP tool aimed at improving the after-sales process for dealerships and resellers. My work involves creating intuitive interfaces and efficient components that enhance the user experience, collaborating with a multidisciplinary team to ensure a scalable and high-performing product. <br /><br /> Previously, at <a href='https://meta.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>Meta</a>, I led the development of an AI chatbot, enhancing customer support through React, Tailwind CSS, Redux, and TypeScript. My earlier roles included contributing to a universal ERP software and leading the development of a payment platform, showcasing adaptability and leadership. <br /><br /> Before Meta, I worked as a Junior Web Developer at <a href='https://webde.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>Webde Tecnologia</a>, excelling in interface development using Next.js, PHP, and Laravel. I began my career at <a href='https://www.nucleosistemas.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>Nucleo IT</a>, installing BI systems and developing corporate websites. <br /><br /> Throughout this exciting journey, my girlfriend and our furry companion are my pillars of support. Their encouragement fuels my passion for web development, turning challenges into shared victories. Fluent in English, conversational in Spanish, and a native Portuguese speaker, I balance my passion for technology with gaming, football, quality family time, and occasional adventures across Brazil. My journey reflects a commitment to learning and creating user-centered web solutions in the ever-evolving tech landscape, with a strong enthusiasm for user experience (UX)."
  },
  "experiences": {
    "Foodiary": {
      "date": "08/2025 - Present",
      "company": "Foodiary",
      "companyUrl": "https://www.foodiaryai.com/",
      "position": "Founder & Developer",
      "description": "I created Foodiary, a mobile nutrition app that uses AI to simplify meal logging. Built with React Native (Expo) and a serverless cloud API, with the entire interface design crafted by me. I'm responsible for the full product lifecycle, from ideation to strategy.",
      "technologies": [
        "React Native",
        "Expo",
        "TypeScript",
        "Node.js",
        "AWS",
        "Serverless"
      ]
    },
    "Mobiauto": {
      "date": "04/2024 - Present",
      "company": "Mobiauto",
      "companyUrl": "https://www.mobiauto.com.br/",
      "position": "Front End Engineer",
      "description": "At Mobiauto, I am working on developing an ERP tool focused on improving the after-sales process for dealerships and resellers. My role involves creating intuitive interfaces and efficient components that make users' daily tasks easier. I collaborate with a multidisciplinary team to ensure the product is scalable, high-performing, and user-friendly.\n\nIn addition to developing new features, I am always looking for solutions to enhance the user experience and add more value to the system. We use the Scrum methodology, which helps keep the project organized and ensures consistent deliveries.",
      "technologies": [
        "React",
        "Recoil",
        "TypeScript",
        "Material UI",
        "Styled Components",
        "Scrum"
      ]
    },
    "Meta": {
      "date": "07/2022 - 04/2024",
      "company": "Meta",
      "companyUrl": "https://www.meta.com.br/",
      "position": "Front End Developer",
      "description": "During my time at Meta, I was involved in the development of an innovative ERP software designed for internet-based companies, as well as a chat app that utilized AI to assist the support team in handling client calls and messages. My focus on scalability, performance, and usability was reflected in my ability to design and implement new components and pages.\n\nI was also committed to enhancing the user experience through cutting-edge ideas. Working alongside a diverse team of developers, testers, and DevOps, we utilized Scrum methodology to ensure seamless collaboration and high-quality solutions.",
      "technologies": [
        "React",
        "Redux",
        "Next.js",
        "TypeScript",
        "SASS",
        "Material UI",
        "Styled Components",
        "Scrum"
      ]
    },
    "Webde": {
      "date": "01/2021 - 07/2022",
      "company": "Webde",
      "companyUrl": "https://webde.com.br/",
      "position": "Front End Developer",
      "description": "I have built an extensive track record in developing corporate and institutional websites and interfaces. I made critical decisions and implemented crucial improvements as part of the development team. Additionally, I specialized in restructuring legacy code and incorporating industry best practices into new projects. My proficiency in Next.js, PHP, and Laravel played a key role in creating several high-quality websites that meet the highest standards of quality and performance.",
      "technologies": [
        "React",
        "Redux",
        "Next.js",
        "TypeScript",
        "SASS",
        "Vercel"
      ]
    },
    "Freelancer": {
      "date": "03/2019 - Present",
      "company": "Freelancer",
      "position": "Front End Developer",
      "companyUrl": "https://www.linkedin.com/in/breno-fiorese/",
      "description": "In my journey as a freelance front-end developer, I have immersed myself in various projects, bringing exceptional websites and interfaces to life. My approach involves applying innovative industry practices and exploring the latest technologies. I have established a close connection with clients, ensuring that their visions are masterfully translated, resulting in successful project delivery within established timelines and agreed budgets.",
      "technologies": [
        "React",
        "Redux",
        "PHP",
        "Next.js",
        "TypeScript",
        "SASS",
        "Vercel"
      ]
    },
    "Nucleo": {
      "date": "03/2019 - 01/2020",
      "company": "Nucleo IT",
      "companyUrl": "https://nucleosistemas.com.br/",
      "position": "Front End Trainee",
      "description": "As a developer intern, my contribution involved implementing BI systems for various companies. Additionally, I gained valuable experience in developing corporate websites for a variety of organizations throughout the state, including the creation of the company's own website. I also worked on the development of a web application for a local company, which involved the use of PHP, jQuery, Bootstrap, and MySQL.",
      "technologies": ["React", "PHP", "jQuery", "Bootstrap", "MySQL"]
    }
  },
  "projects": {
    "Fincheck": {
      "title": "Fincheck",
      "description": "Fincheck is a financial management platform that helps users keep track of their expenses, income, and investments. It provides a comprehensive overview of their financial health, allowing them to make informed decisions about their money. The platform also offers personalized recommendations and insights to help users achieve their financial goals.",
      "url": "",
      "technologies": [
        "React",
        "TypeScript",
        "Radix UI",
        "NestJS",
        "PostgreSQL",
        "Docker"
      ]
    },
    "MKBOT": {
      "title": "MKBot",
      "description": "MKBot is a chatbot that uses AI to help the support team answer all the calls and messages from the clients. It is integrated with WhatsApp, Facebook Messenger, and Telegram. It also has a complete management and statistics system.",
      "url": "",
      "technologies": [
        "React",
        "Redux",
        "TypeScript",
        "Tailwind CSS",
        "Material UI",
        "WebSocket",
        "Scrum"
      ]
    },
    "Caravaggio": {
      "title": "Caravaggio",
      "description": "Website created for the Caravaggio Cathedral in Farroupilha, RS. It features a content management system where it is possible to add, edit, and remove news, events, Mass schedules, among other things, as well as a space to livestream the cathedral's Masses and events.",
      "url": "https://caravaggio.org.br/",
      "technologies": ["React", "Next.js", "TypeScript", "SASS", "Vercel"]
    },
    "Esterili-med": {
      "title": "Esterili-med",
      "description": "This website was meticulously developed for Esterili-Med, a leading company in the production and distribution of top-tier disposable healthcare items since 1994. Located in Caxias do Sul-RS, the site features intricate animations and components, making the coding process challenging yet rewarding. ",
      "url": "https://esterili-med.com.br/",
      "technologies": ["React", "Next.js", "TypeScript", "SASS", "Vercel"]
    },
    "HSFDA": {
      "title": "Hospital São Francisco de Assis",
      "description": "This is the official website of Hospital São Francisco de Assis, a leading healthcare provider in Parobé-RS. The site features a content management system where it is possible to add, edit, and remove news, events, new-born babies and other information.",
      "url": "https://www.hospitalparobe.com.br/",
      "technologies": ["React", "Next.js", "TypeScript", "SASS", "Vercel"]
    }
  },
  "devlog": {
    "title": "Devlog",
    "subtitle": "Technical updates and insights about my personal projects",
    "morePosts": "More posts"
  },
  "components": {
    "navigation": {
      "about": "About",
      "experiences": "Experiences",
      "projects": "Projects",
      "devlog": "Devlog"
    },
    "resume": {
      "viewFull": "View Full Résumé"
    },
    "footer": {
      "inspiration": "Design inspired by <a href='https://brittanychiang.com/' class='font-medium text-slate-500 hover:text-teal-300 focus-visible:text-teal-300' target='_blank' rel='noreferrer noopener' aria-label='Brittany Chiang (opens in a new tab)'>Brittany Chiang</a>"
    }
  }
}
