{
  "sections": {
    "about": "Sobre",
    "experiences": "Experiências",
    "projects": "Projetos"
  },
  "about": {
    "title": "Experienced Front End Engineer",
    "motto": "Eu desenvolvo experiências digitais excepcionais e acessíveis para a web.",
    "text": "Em 2023, iniciei meu curso de Engenharia de Software na UNOPAR, complementado por cursos na <a href='https://jstack.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>JStack</a> e nos bootcamps da <a href='https://rocketseat.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>Rocketseat</a>. Com base em Santa Cruz do Sul, Rio Grande do Sul, sou um experiente Desenvolvedor Web Frontend proficientemente versado em React, TypeScript, Next.JS, PHP e Laravel. <br /><br /> Atualmente, na <a href='https://www.mobiauto.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>Mobiauto</a>, estou focado no desenvolvimento de uma ferramenta ERP voltada para o setor de pós-vendas de concessionárias e revendas. Meu trabalho envolve a criação de interfaces intuitivas e componentes eficientes que melhoram a experiência do usuário, colaborando com uma equipe multidisciplinar para garantir um produto escalável e de alto desempenho.<br /><br /> Anteriormente, na <a href='https://meta.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>Meta</a>, liderei o desenvolvimento de um chatbot de IA, aprimorando o suporte ao cliente por meio de React, Tailwind CSS, Redux e TypeScript. Minhas funções anteriores envolveram contribuir para um software ERP universal e liderar o desenvolvimento de uma plataforma de pagamentos, demonstrando adaptabilidade e liderança. <br /><br /> Antes da Meta, atuei como Desenvolvedor Web Júnior na <a href='https://webde.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>Webde Tecnologia</a>, destacando-me no desenvolvimento de interfaces usando Next.JS, PHP e Laravel. Iniciei minha carreira na <a href='https://www.nucleosistemas.com.br/' target='_blank' class='font-medium text-slate-200 hover:text-purple-300 focus-visible:text-purple-300'>Nucleo IT</a>, instalando sistemas de BI e desenvolvendo sites empresariais. <br /><br /> Nessa jornada empolgante, minha namorada e nossa companheira peluda são meus pilares de apoio. O incentivo delas alimenta minha paixão pelo desenvolvimento web, transformando desafios em vitórias compartilhadas. Fluente em inglês, com habilidades de conversação em espanhol e falante nativo de português, equilibro minha paixão pela tecnologia com jogos, futebol, muito tempo em família e aventuras ocasionais pelo Brasil. Minha jornada reflete um compromisso com a aprendizagem e a criação de soluções web centradas no usuário no cenário tecnológico em constante evolução, com grande entusiasmo pela experiência do usuário (UX)."
  },
  "experiences": {
    "Mobiauto": {
      "date": "04/2024 - Presente",
      "company": "Mobiauto",
      "companyUrl": "https://www.mobiauto.com.br/",
      "position": "Front End Engineer",
      "description": "Na Mobiauto, estou trabalhando no desenvolvimento de uma ferramenta ERP focada em melhorar o pós-vendas de concessionárias e revendas. Minha atuação envolve a criação de interfaces intuitivas e componentes eficientes que facilitam o dia a dia dos usuários. Colaboro com uma equipe multidisciplinar para garantir que o produto seja escalável, performático e fácil de usar.\n\nAlém de desenvolver novas funcionalidades, estou sempre em busca de soluções que aprimorem a experiência do usuário e tragam mais valor para o sistema. Utilizamos a metodologia Scrum, o que ajuda a manter o projeto organizado e com entregas consistentes.",
      "technologies": [
        "React",
        "Recoil",
        "TypeScript",
        "Material UI",
        "Styled Components",
        "Scrum"
      ]
    },
    "Meta": {
      "date": "07/2022 - 04/2024",
      "company": "Meta",
      "companyUrl": "https://www.meta.com.br/",
      "position": "Front End Developer",
      "description": "Fiz parte do desenvolvimento de um software ERP inovador projetado para empresas baseadas na internet, que pode ser usado de forma universal, bem como de um aplicativo de chat que utiliza inteligência artificial para ajudar a equipe de suporte a responder todas as chamadas e mensagens dos clientes. Meu foco em escalabilidade, desempenho e usabilidade reflete-se na minha capacidade de projetar e implementar novos componentes e páginas.\n\nAlém disso, estou comprometido em aprimorar a experiência do usuário por meio de ideias de ponta. Trabalho ao lado de uma equipe diversificada de desenvolvedores, testadores e DevOps, utilizando a metodologia Scrum para garantir uma colaboração fluida e soluções de alta qualidade.",
      "technologies": [
        "React",
        "Redux",
        "Next.js",
        "TypeScript",
        "SASS",
        "Material UI",
        "Styled Components",
        "Scrum"
      ]
    },
    "Webde": {
      "date": "01/2021 - 07/2022",
      "company": "Webde",
      "companyUrl": "https://webde.com.br/",
      "position": "Front End Developer",
      "description": "Eu construí um extenso histórico no desenvolvimento de sites e interfaces corporativos e institucionais. Tomei decisões críticas e implementei melhorias essenciais como parte da equipe de desenvolvimento. Além disso, especializei-me na reestruturação de códigos legados e na incorporação das melhores práticas da indústria em novos projetos. Minha proficiência em Next.js, PHP e Laravel desempenhou um papel fundamental na criação de vários websites de alta qualidade que atendem aos mais altos padrões de qualidade e desempenho.",
      "technologies": [
        "React",
        "Redux",
        "Next.js",
        "TypeScript",
        "SASS",
        "Vercel"
      ]
    },
    "Freelancer": {
      "date": "03/2019 - Presente",
      "company": "Freelancer",
      "companyUrl": "https://www.linkedin.com/in/breno-fiorese/",
      "position": "Front End Developer",
      "description": "Em minha jornada como desenvolvedor front-end freelancer, mergulhei em diversos projetos, dando vida a sites e interfaces excepcionais. Minha abordagem envolve a aplicação de práticas inovadoras da indústria e a exploração das mais recentes tecnologias. Estabeleci uma conexão próxima com os clientes, garantindo que suas visões sejam traduzidas de maneira magistral, resultando na entrega bem-sucedida do projeto dentro dos prazos estabelecidos e dos orçamentos acordados.",
      "technologies": [
        "React",
        "Redux",
        "PHP",
        "Next.js",
        "TypeScript",
        "SASS",
        "Vercel"
      ]
    },
    "Nucleo": {
      "date": "03/2019 - 01/2020",
      "company": "Nucleo IT",
      "companyUrl": "https://nucleosistemas.com.br/",
      "position": "Front End Trainee",
      "description": "Como estagiário de desenvolvimento, minha contribuição envolveu a implementação de sistemas de BI para várias empresas. Além disso, adquiri uma experiência valiosa no desenvolvimento de sites corporativos para diversas organizações em todo o estado, incluindo a criação do site da própria empresa. Também participei do desenvolvimento de uma aplicação web para uma empresa local, que envolveu o uso de PHP, jQuery, Bootstrap e MySQL.",
      "technologies": ["React", "PHP", "jQuery", "Bootstrap", "MySQL"]
    }
  },
  "projects": {
    "Fincheck": {
      "title": "Fincheck",
      "description": "Fincheck é uma plataforma de gestão financeira que permite aos usuários controlar suas finanças pessoais de forma eficiente. Com um design intuitivo e funcionalidades avançadas, o Fincheck ajuda os usuários a economizar tempo e dinheiro, fornecendo insights valiosos sobre seus hábitos de consumo.",
      "url": "",
      "technologies": [
        "React",
        "TypeScript",
        "Radix UI",
        "NestJS",
        "PostgreSQL",
        "Docker"
      ]
    },
    "MKBOT": {
      "title": "MKBot",
      "description": "MKBot é um chatbot que utiliza inteligência artificial para auxiliar a equipe de suporte a responder todas as chamadas e mensagens dos clientes. Ele está integrado ao WhatsApp, Facebook Messenger e Telegram. Além disso, possui um sistema completo de gestão e estatísticas.",
      "url": "",
      "technologies": [
        "React",
        "Redux",
        "TypeScript",
        "Tailwind CSS",
        "Material UI",
        "WebSocket",
        "Scrum"
      ]
    },
    "Caravaggio": {
      "title": "Caravaggio",
      "description": "Site criado para a Catedral de Caravaggio em Farroupilha, RS. Ele apresenta um sistema de gerenciamento de conteúdo onde é possível adicionar, editar e remover notícias, eventos, horários de missas, entre outras coisas, além de um espaço para transmitir ao vivo as missas e eventos da catedral.",
      "url": "https://caravaggio.org.br/",
      "technologies": ["React", "Next.js", "TypeScript", "SASS", "Vercel"]
    },
    "Esterili-med": {
      "title": "Esterili-med",
      "description": "Este site foi meticulosamente desenvolvido para a Esterili-Med, uma empresa líder na produção e distribuição de artigos descartáveis de alta qualidade para a área da saúde desde 1994. Localizada em Caxias do Sul-RS, o site apresenta animações e componentes intricados, tornando o processo de codificação desafiador, mas gratificante.",
      "url": "https://esterili-med.com.br/",
      "technologies": ["React", "Next.js", "TypeScript", "SASS", "Vercel"]
    },
    "HSFDA": {
      "title": "Hospital São Francisco de Assis",
      "description": "Este é o site oficial do Hospital São Francisco de Assis, um dos principais provedores de serviços de saúde em Parobé-RS. O site possui um sistema de gerenciamento de conteúdo que permite adicionar, editar e remover notícias, eventos, recém-nascidos e outras informações.",
      "url": "https://www.hospitalparobe.com.br/",
      "technologies": ["React", "Next.js", "TypeScript", "SASS", "Vercel"]
    }
  },
  "components": {
    "navigation": {
      "about": "Sobre",
      "experiences": "Experiências",
      "projects": "Projetos"
    },
    "resume": {
      "viewFull": "Ver currículo completo"
    },
    "footer": {
      "inspiration": "Design inspirado por <a href='https://brittanychiang.com/' class='font-medium text-slate-500 hover:text-teal-300 focus-visible:text-teal-300' target='_blank' rel='noreferrer noopener' aria-label='Brittany Chiang (opens in a new tab)'>Brittany Chiang</a>"
    }
  }
}
