{
  "experiences": [
    {
      "date": "07/2022 - Presente",
      "company": "Meta",
      "companyUrl": "https://www.meta.com.br/",
      "position": "Front End Developer",
      "description": "Atualmente, desempenho um papel fundamental no desenvolvimento de um software de ERP, projetado para provedores de internet, que tem uma aplicação universal. Além disso, estou envolvido no desenvolvimento de um aplicativo de Chatbot que utiliza inteligência artificial para oferecer suporte aos clientes dos provedores de internet. Minha principal ênfase é a escalabilidade, desempenho e usabilidade, o que se reflete na minha capacidade de projetar e implementar novos componentes e páginas com excelência.\n\nComprometo-me a aprimorar constantemente a experiência do usuário, utilizando ideias criativas e inovadoras. Trabalho em estreita colaboração com uma equipe diversificada de desenvolvedores, QA testers e DevOps, seguindo a metodologia Scrum para garantir uma colaboração perfeita e a entrega de soluções de alta qualidade.",
      "technologies": [
        "React",
        "Redux",
        "Next.js",
        "TypeScript",
        "SASS",
        "Material UI",
        "Styled Components",
        "Scrum"
      ]
    },
    {
      "date": "01/2021 - 07/2022",
      "company": "Webde",
      "companyUrl": "https://webde.com.br/",
      "position": "Front End Developer",
      "description": "Adquiri um histórico de desenvolvimento extenso de interfaces e sites corporativos/institucionais. Tomei decisões e implementei melhorias cruciais como parte da equipe de desenvolvimento. Além disso, especializei-me em reestruturar códigos legados e implementar as melhores práticas da indústria em novos projetos. Minha proficiência em Next.JS, PHP e Laravel foi fundamental na criação de vários sites de alta qualidade que atendem aos mais altos padrões de qualidade e desempenho.",
      "technologies": [
        "React",
        "Redux",
        "Next.js",
        "TypeScript",
        "SASS",
        "Vercel"
      ]
    },
    {
      "date": "03/2019 - Presente",
      "company": "Freelancer",
      "position": "Front End Developer",
      "description": "Em minha jornada como desenvolvedor front-end freelancer, mergulhei em projetos diversos, dando vida a websites e interfaces de excelência. Minha abordagem envolve a aplicação de práticas inovadoras da indústria e a exploração das mais recentes tecnologias. Estabeleci uma conexão próxima com os clientes, assegurando que suas visões fossem traduzidas com maestria, resultando na entrega bem-sucedida de projetos dentro dos prazos estabelecidos e orçamentos acordados.",
      "technologies": [
        "React",
        "Redux",
        "PHP",
        "Next.js",
        "TypeScript",
        "SASS",
        "Vercel"
      ]
    },
    {
      "date": "03/2019 - 01/2020",
      "company": "Nucleo IT",
      "companyUrl": "https://nucleosistemas.com.br/",
      "position": "Front End Estagiário",
      "description": "Como estagiário de desenvolvedor, minha contribuição envolveu a implementação de sistemas BI em diversas empresas. Além disso, ganhei uma experiência valiosa no desenvolvimento de websites corporativos para uma variedade de organizações em todo o estado, inclusive na criação do próprio website da empresa.",
      "technologies": ["React", "PHP", "jQuery", "Bootstrap", "MySQL"]
    }
  ]
}
